Revit 2025 API
ParameterTypeId.RebarShapeHookStartType Property
 "Hook At Start"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public static ForgeTypeId RebarShapeHookStartType { get; }
Public Shared ReadOnly Property RebarShapeHookStartType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarShapeHookStartType {
	ForgeTypeId^ get ();
}
static member RebarShapeHookStartType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace